#Задание 1
print("Введите ваш возраст:")
age = int(input( ))
print("Введите возраст вашего друга:")
age1 = int(input( ))
print("Сумма ваших возрастов:", age + age1)\
#Задание 2
print("Введите ваше имя:")
name = input()
print("Введите вашу фамилию:")
surname = input()
print('Привет, ',name,surname,'!')
#Задание 3
print("Меню:\n 1. Суп\n 2. Паста\n 3. Десерт")
#Задание 4
print("***\n***\n***\n")
#Задание 5
x = int(input("Число: "))
print(x-3,x-2,x-1)
print(x)
print(x+3,x+2,x+1)
