#Задание 1
print("Введите ваш возраст:")
age = int(input( ))
print("Введите возраст вашего друга:")
age1 = int(input( ))
print("Сумма ваших возрастов:", age + age1)\
#Задание 2
print("Введите ваше имя:")
name = input()
print("Введите вашу фамилию:")
surname = input()
print('Привет, ',name,surname,'!')
#Задание 3
